##=================================================
## DataFrame 인스턴스 객체 생성-다양한 방식
##=================================================
# 모듈 로딩
import pandas as pd

##-------------------------------------------------
## => 데이터 준비
##-------------------------------------------------
jumsu=[[99,77,55],
       [77,88,66]]

##-------------------------------------------------
## => DataFrame 으로 변환 저장
##-------------------------------------------------
dataDF=pd.DataFrame(jumsu)

##-------------------------------------------------
## =>  List와  DataFrame 데이터 표현/저장 방식 비교
##-------------------------------------------------
print('--[List 방식]--')
print(jumsu)

print('--[ DataFrame 방식]--')
print(dataDF)
##인덱스, 데이터 타입과 같이나옴

##-------------------------------------------------
## =>  DataFrame 인스턴스의 속성 읽기
##-------------------------------------------------
print('--[Series 속성]--')
print(f'인덱스:{dataDF.index}')
print(f'컬럼즈:{dataDF.columns}')
print(f'데이터:\n{dataDF.values},{type(dataDF.values)}')
print(f'형태:{dataDF.shape}')      ##2차원 (행,열)
print(f'차원:{dataDF.ndim}차원')    ##2차원
print(f'타입:\n{dataDF.dtypes}')     ##컬럼별 타입들