## -------------------------------------------------------------------------
## 쇼핑 app 만들기
## 상품 목록 (이름, 가격)
## 장바구니 목록
## 총 가격
## 사용자의 종료 입력 전까지 반복
## -------------------------------------------------------------------------
## -------------------------------------------------------------------------
## 전역변수 선언
## -------------------------------------------------------------------------

# 장바구니 목록
FILE_NAME = './buy_history.txt'

## -------------------------------------------------------------------------
## 사용자 정의 함수들
## -------------------------------------------------------------------------

## --------------------------------------------------------
## 함수기능 : 메인메뉴 출력 기능
## 함수이름 : printMenu
## 매개변수 : 없음
## 결과반환 : 없음
## --------------------------------------------------------
def printMenu():
    print(f'{"선택":-^10}')
    print(f'{"1. 상품 목록":<12}')
    print(f'{"2. 장바구니 목록":<12}')
    print(f'{"3. 계  산":<12}')
    print(f'{"X. 종  료":<12}')
    print(f'{"":-^12}')

## --------------------------------------------------------
## 함수기능 : 상품 목록 출력하고 고르기
## 함수이름 : show_choose
## 매개변수 : 없음
## 결과반환 : 없음
## --------------------------------------------------------
def show_choose():
    dic = {'반팔 티셔츠' : 15000, '긴팔 티셔츠' : 20000, '청바지' : 30000, '모자' : 10000, '신발' : 25000}
    for i in dic:
        print(f'상품명 : {i}, 가격 : {dic[i]}원')
    
    choose = input("어떤 상품을 구매하시겠습니까? (예 : 반팔 티셔츠) : ")
    if choose in dic:
        price = dic[choose]
        with open(FILE_NAME, mode='a', encoding='utf-8')as F:
            F.write(choose+'\n')
        print('상품이 장바구니에 담겼습니다!')

## --------------------------------------------------------
## 함수기능 : 장바구니 안에 담겨있는 상품 조회하기
## 함수이름 : bf_buy
## 매개변수 : 없음
## 결과반환 : 없음
## --------------------------------------------------------
def bf_buy():
    with open(FILE_NAME, mode='r', encoding='utf-8')as F:
        lines = F.readlines()

        for line in lines:
            print(line.strip())
        print()

## --------------------------------------------------------
## 함수기능 : 장바구니 담긴 상품 총 금액 계산하기
## 함수이름 : total_price
## 매개변수 : 없음
## 결과반환 : 없음
## --------------------------------------------------------
def total_price():
    dic = {'반팔 티셔츠' : 15000, '긴팔 티셔츠' : 20000, '청바지' : 30000, '모자' : 10000, '신발' : 25000}
    total = 0
    with open(FILE_NAME, mode='r', encoding='utf-8')as F:
        lines = F.readlines()

        for line in lines:
            if line.strip() in ('반팔 티셔츠', '긴팔 티셔츠', '청바지', '모자', '신발'):
                total += dic[line.strip()]
        print(f'총 금액은 {total}원 입니다.')

## --------------------------------------------------------
## 프로그램 구동 부분
## --------------------------------------------------------
print("쇼핑 어플 시작")

while True:
    # 메뉴 출력
    printMenu()
    cmd = input("선택:")

    # 종료 체크 및 처리
    if cmd in ['X', 'x']: break
    elif cmd == '1':
        show_choose()
    elif cmd == '2':
        bf_buy()
    elif cmd == '3':
        total_price()
    else:
        print("존재하지 않는 항목입니다.")


print("쇼핑 어플 종료")
