/* *************************************************************
* Filename     : ex01_func.c
* Description  : 문자/문자열 입력에 대한 처리
*				 -> 표준입력 함수로 키보드로 부터 입력 받기
*				 -> 형식지정자에 맞는 데이터 타입 입력 및 저장
*				 -> 덴터기 입력 전까지 모든 입력을 전달 받음
* Author       : LJG
* History	   : 2026-01-05
* ***************************************************************/

// --------------------------------------------------------------
// Loading Library : 전처리기에서 처리
// --------------------------------------------------------------
#include <stdio.h>

// --------------------------------------------------------------
// Entry Point [실습] 문자/문자열 입력에 대한 scanf()처리
// -> 형식지정자 %c, %s에 따른 처리
// -> 엔터키에 관련된 문자 '\n' 함께 전달 받음
// -> 문자 '\n' 제외한 나머지 %c, %s에 맞추어서 전달
// -> 입력 버퍼에 '\n' 남아있음! ==> 처리 필요함!!
// --------------------------------------------------------------
// 길이가 5개 이하인 단어 입력 받아서 저장하기
// --------------------------------------------------------------
int main(void)
{
	// 변수 선언
	char  msg[5] = { 0 };
	int   nums[5] = { 0 };

	// 입력 받기
	for (int i = 0; i < 5; i++)
	{
		printf("\n문자 입력:");
		// 반복해서 문자 입력 시 버퍼에 잔존한 \n처리용 공백 추가
		if(scanf("  %c", &msg[i]) != 1) return 0;
		getchar();		// 엔터기 처리용
		//if (scanf("%d", &nums[i]) != 1) return 0;
	}
	// 종료 의미의 널문자 추가
	msg[5] = '\0';

	
	// 저장 확인
	for (int i = 0; i < 5; i++)
		printf("%c", msg[i]);

	// %s 형식지정자 => \0 널문자 앞까지 읽어와서 출력
	printf("%s", msg);

	return 0;
}