/* *************************************************************
* Filename     : ex02_2d_array.c
* Description  : 2차원 배열 선언 및 초기화
* Author       : LJG
* History	   : 2026-01-05
* ***************************************************************/

// --------------------------------------------------------------
// Loading Library : 전처리기에서 처리
// --------------------------------------------------------------
#include <stdio.h>

// --------------------------------------------------------------
// Entry Point [실습] 2차원 배열 선언 및 초기화 방법 이해
// --------------------------------------------------------------
int main(void)
{
	// 변수 선언 + 초기화
	int arr1[2][3] = { {11,22,33},{44,55,66} };
	int arr2[2][3] = { 11,22,33,44,55,66 };

	int arr3[2][3] = { {11,22},{44} };
	int arr4[2][3] = { 11,22,44 };


	// 원소 확인
	printf("\n==> arr1 : ");
	for (int r = 0; r < 2; r++)
	{
		for (int c = 0; c < 3; c++)
			printf("arr[%d][%d] = %d  ", r, c, arr1[r][c]);
	}
	
	printf("\n==> arr2 : ");
	for (int r = 0; r < 2; r++)
	{
		for (int c = 0; c < 3; c++)
			printf("arr[%d][%d] = %d  ", r, c, arr2[r][c]);
	}

	printf("\n\n==> arr3 : ");
	for (int r = 0; r < 2; r++)
	{
		for (int c = 0; c < 3; c++)
			printf("arr[%d][%d] = %d  ", r, c, arr3[r][c]);
	}

	printf("\n==> arr4 : ");
	for (int r = 0; r < 2; r++)
	{
		for (int c = 0; c < 3; c++)
			printf("arr[%d][%d] = %d  ", r, c, arr4[r][c]);
	}

	return 0;
}