#include <stdio.h>
//=====================================================
// [문제-1] 
// 회문(palindrome)은 순서를 거꾸로 읽어도 제대로 읽은 것과 같은 
// 단어와 문장 의미
// 
// 입력받은 단어 또는 문장이 회문인지 판별해서 반환해주는 함수를
// 구현해 주세요.
//=====================================================
//int is_pa(const char* s)
//{
//	int left = 0;
//	int right = 0;
//
//	while (s[right] != '\0')
//		right++;
//	right--;
//
//	while (left < right)
//	{
//		if (s[left] != s[right])
//			return 0;
//		left++;
//		right--;
//	}
//	return 1;
//}
//int main(void)
//{
//	if (is_pa("level"))
//		printf("회문입니다\n");
//	else
//		printf("회문이 아닙니다\n");
//	return 0;
//}


//=====================================================
// [문제-2] 
// 포인터 변수가 저장하고 있는 메모리 주소를 출력하는 함수를 
// 구현하세요.
// - 매개변수 : 메모리 주소 
// - 반환결과 : 저장하고 있는 메모리 주소
// 입출력예시) 
//=====================================================
//void re(int* p)
//{
//	printf("메모리 주소는 : %p", p);
//}
//
//int main(void)
//{
//	int num = 123;
//
//	re(&num);
//}


//=====================================================
// [문제-2] 
// 2개 이진수 문자열 bin1과 bin2을 입력받아 덧셈 결과를 출력
// 하는 코드를 작성하세요. 
// 입출력예시) "10"    "11"  ==>  "101"
//           "1001"	"1111" ==>  "11000"
//=====================================================
#include <string.h>
void bi_add()
{

}