/* *************************************************************
* Filename     : ex04_array.c
* Description  : 배열
* Author       : LJG
* History	   : 2026.01.02
* ***************************************************************/

// --------------------------------------------------------------
// Loading Library
// --------------------------------------------------------------
#include <stdio.h>

int main(void)
{
	//  선언 및 초기화

	// 문자 10개 저장 변수
	char ch[10];

	// 입력받아서 저장
	printf("문자 10개로 구성된 문자열 입력: ");
	scanf("%9s", ch);		// 길이제한 .
							// 입력받은 문자열에 널문자/종료문자를 추가해서 저장

	printf("array ch : %s\n", ch);

	return 0;
}