/* *************************************************************
* Filename     : ex01_array.c
* Description  : 배열
* Author       : LJG
* History	   : 2026.01.02
* ***************************************************************/
// --------------------------------------------------------------
// Loading Library
// --------------------------------------------------------------
#include <stdio.h>


// --------------------------------------------------------------
// 변수와 배열 차이 이해
// => 30명의 점수를 저장 및 출력
// --------------------------------------------------------------
int main(void)
{
	// 지역변수 선언 및 초기화
	//int score1, score2, score3, ..., score30;
	int	   score[30];
	
	// 지역변수 초기화
	score[0] = 10;
	score[1] = 20;
	score[2] = 30;
	score[3] = 40;
	score[4] = 50;

	// 배열요소 값 확인
	for(int idx=0; idx<5; idx++)
		printf("score[%d] => %d\n", idx, score[idx]);

	// 배열이름으로 모든 원소 출력 X
	//printf("score => %d\n", score);


	return 0;
}