/* *************************************************************
* Filename     : ex01_while.c
* Description  : 반복문 - while
*				 반복 횟수가 정해진 경우 & 정해지지 않은 경우
* Author       : LJG
* History	   : 2026.01.02
* ***************************************************************/

// --------------------------------------------------------------
// Loading Library
// --------------------------------------------------------------
#include <stdio.h>


// --------------------------------------------------------------
// [실습] while 반복문 기본 형식 이해
//		  1~50 범위의 숫자 출력
// --------------------------------------------------------------
int main(void)
{
	// 지역변수 선언 및 초기화
	int		    num = 1;
	const int LIMIT = 50;

	// 반복용 변수 초기화
	num = 1;

	// while 반복문
	while (num <= LIMIT)
	{
		printf("num = %d\n", num);

		//delay용 코드
		for (int i = 0; i < 1000000000; i++);
		num++;
	}

	return 0;
}