/* *************************************************************
* Filename     : ex02_while.c
* Description  : 반복문 - while
*				 반복 횟수가 정해진 경우 & 정해지지 않은 경우
* Author       : LJG
* History	   : 2026.01.02
* ***************************************************************/

// --------------------------------------------------------------
// Loading Library
// --------------------------------------------------------------
#include <stdio.h>


// --------------------------------------------------------------
// [실습] while 반복문 기본 형식 이해
// --------------------------------------------------------------
int main(void)
{
	// 지역변수 선언 및 초기화
	int num;
	int sum = 0;

	printf("숫자를 입력하세요. (예12345)>");
	scanf("%d", &num);

	// while 반복문
	while (num)
	{
		sum += num % 10;
		printf("sum=%3d num=%d\n", sum, num);

		num /= 10;
	}

	printf("각 자리수의 합:%d\n", sum);
	return 0;
}