/* *************************************************************
* Filename     : ex04_while.c
* Description  : 반복문 - while
*				 반복 횟수가 정해진 경우 & 정해지지 않은 경우
* Author       : LJG
* History	   : 2026.01.02
* ***************************************************************/

// --------------------------------------------------------------
// Loading Library
// --------------------------------------------------------------
#include <stdio.h>


// --------------------------------------------------------------
// [실습] while 반복 중단
//		  flag 변수값에 따른 중단 방법
// --------------------------------------------------------------
int main(void)
{
	// 지역변수 선언 및 초기화
	int num, sum = 0, flag = 1;

	// 프로그램 동작 문구 출력
	printf("합계 계산용 숫자 입력(단, 0입력 시 종료)");

	// 언제 0 입력 할지 모름 => 반복 입력 횟수 X
	while (flag)		// while(1) <-- 무한 반복
	{
		// 프롬프트 출력
		printf(">>");
		scanf("%d", &num);

		// 종료 조건 체크 후 합계 계산
		if (num)
			sum += num;
		else
			flag = 0;	// 종료 설정
		// 삼항연산자/조건연산자 : (조건식) ? 참 : 거짓;
		//(num != 0) ? sum = sum + num : flag = 0;
	}

	printf("총합 : %d", sum);

	return 0;
}