/* *************************************************************
* Filename     : ex06_loop.c
* Description  : 무한반복문 - while/for
* Author       : LJG
* History	   : 2026.01.02
* ***************************************************************/

// --------------------------------------------------------------
// Loading Library
// --------------------------------------------------------------
#include <stdio.h>			// C언어 표준입출력 라이브러리
#include <stdlib.h>			// C언어 표준라이브러리		 -> rand(), srand() 
#include <time.h>			// C언어 시간관련 라이브러리 -> time()

// --------------------------------------------------------------
// [실습] for/while 무한 반복
// --------------------------------------------------------------
int main(void)
{
	// for 반복문의 무한루프 형식--------------------------------
	// -> 조건부 부분 빈 공란
	/*for (int i = 0;	 ;i++)
	{
		printf("무한 반복 1 - %d \n", i);
	}*/

	/*for (;;)
	{
		printf("무한 반복 2 \n");
	}*/

	// while반복문의 무한루프 형식 ------------------------------
	// 조건부 부분이 0이 아니면 됨!
	while (1)
	{
		printf("무한 반복 while\n");
	}

	return 0;
}