/* *************************************************************
* Filename     : ex07_goto.c
* Description  : 분기문 - goto
* Author       : LJG
* History	   : 2026.01.02
* ***************************************************************/

// --------------------------------------------------------------
// Loading Library
// --------------------------------------------------------------
#include <stdio.h>

// --------------------------------------------------------------
// [실습] 분기문 - goto 이해
// --------------------------------------------------------------
int main(void)
{
START:
	printf("시작\n");

	// 라벨이 명시된 코드 부분으로 이동
	goto JUMP;

	printf("이 문장은 실행되지 않습니다.\n");

	// 라벨: -> 대문자로 작성
JUMP:
	printf("JUMP 라벨로 이동했습니다.\n");

	goto JUMP;
	

	return 0;
}