-- ===========================================================
-- 1. JOIN 문제 (J1 ~ J10)
-- ===========================================================

use employees;

-- ----------------------------------------------------------
-- J1. 직원의 이름과 현재 소속 부서명
-- 테이블: employees.employees, departments
-- ----------------------------------------------------------
select first_name, dept_no
from employees as em
INNER JOIN dept_emp as de
ON em.emp_no = de.emp_no;



-- ----------------------------------------------------------
-- J2. 현재 부서 관리자 정보
-- 테이블: employees.employees, departments,dept_manager
-- ----------------------------------------------------------
select *
from employees as em
INNER JOIN dept_manager as de
ON em.emp_no = de.emp_no;

-- ----------------------------------------------------------
-- J3. 직원의 현재 직급과 현재 급여
-- 테이블: employees.employees, titles, salaries
-- ----------------------------------------------------------
select tl.title, sl.salary
from employees as em
INNER JOIN titles as tl ON em.emp_no = tl.emp_no
INNER JOIN salaries as sl ON em.emp_no = sl.emp_no;



-- ----------------------------------------------------------
-- J4. 부서별 평균 급여 (60,000 이상인 부서만)
-- 테이블: employees.salaries, departments
-- ----------------------------------------------------------



-- ----------------------------------------------------------
-- J5. 'Sales' 부서에 속한 현재 직원 목록
-- 테이블: employees.employees, departments
-- ----------------------------------------------------------



-- ----------------------------------------------------------
-- J6. 같은 부서에 속한 직원 
-- 테이블: employees.employees, departments
-- ----------------------------------------------------------



-- ----------------------------------------------------------
-- J7. 관리자별 담당 부서 직원 수
-- 테이블: employees.dept_manager, employees, departments
-- ----------------------------------------------------------



-- ----------------------------------------------------------
-- J8. 직급 변경 이력이 있는 직원
-- 테이블: employees.employees, titles
-- ----------------------------------------------------------



-- ----------------------------------------------------------
-- J9. 같은 급여를 받는 직원 
-- 테이블: employees.salaries, employees
-- ----------------------------------------------------------


-- ----------------------------------------------------------
-- J10. 직원별 최근 급여 이력만 조회
-- 테이블: employees.employees, salaries
-- ----------------------------------------------------------

