-- ===========================================================
-- 1. SUBQUERY 문제(S1 ~ S10)
-- ===========================================================

use employees;

-- ----------------------------------------------------------
-- S1. 전체 평균 급여보다 많이 받는 직원
-- 테이블: employees.employees, salaries
-- ----------------------------------------------------------
select *
FROM employees
where where emp_no IN (
    select emp_no FROM salaries
    where salary > (
        select AVG(salary) FROM salaries
    )
);


-- ----------------------------------------------------------
-- S2. 'Sales' 부서에 속한 직원들
-- 테이블: employees.employees, dept_emp
-- ----------------------------------------------------------
select *
from employees
where emp_no in (
    select emp_no from dept_emp
    where dept_no = 'd007'
);


-- ----------------------------------------------------------
-- S3. 급여 기록이 한 번도 없는 직원 
-- 테이블: employees.employees
-- ----------------------------------------------------------
select *
from employees
where emp_no not in (
    select emp_no from salaries
);


-- ----------------------------------------------------------
-- S4. 부서별 평균 급여가 전체 평균보다 높은 부서
-- 테이블: employees.salaries, dept_emp
-- ----------------------------------------------------------
select *
from dept_emp
where emp_no IN (
    select emp_no FROM salaries
    where salary > (
        select AVG(salary) FROM salaries
    )
);


-- ----------------------------------------------------------
-- S5. 각 직원의 최대 급여와 현재 급여
-- 테이블: employees.employees, salaries
-- ----------------------------------------------------------



-- ----------------------------------------------------------
-- S6. 특정 직원(10001)과 같은 급여를 받는 직원들
-- 테이블: employees.employees, salaries
-- ----------------------------------------------------------
select *
from employees
where emp_no in (
    select emp_no from salaries
);


-- ----------------------------------------------------------
-- S7. 직급이 'Manager'인 부서의 모든 직원
-- 테이블: employees.employees, titles, departments
-- ----------------------------------------------------------



-- ----------------------------------------------------------
-- S8. 직원 수가 가장 많은 부서 Top 3
-- 테이블: employees.departments
-- ----------------------------------------------------------



-- ----------------------------------------------------------
-- S9. 부서 이동 이력이 있는 직원
-- 테이블: employees.employees
-- ----------------------------------------------------------


-- ----------------------------------------------------------
-- S10. 직원 수가 가장 많은 부서에 속한 직원들
-- 테이블: employees.employees, departments
-- ----------------------------------------------------------
