/* *************************************************************
* Filename     : ex02_pointer.c
* Description  : 포인터 변수의 값 읽기/쓰기
*				 => *포인터의 위치
*					L-value/R-value
* Author       : LJG
* History	   : 2026-01-07
* ***************************************************************/

// --------------------------------------------------------------
// Library			
// --------------------------------------------------------------
#include <stdio.h>

// --------------------------------------------------------------
// Entry Point Function
// --------------------------------------------------------------
int main(void)
{
	// 변수 선언 및 초기화
	int  value = 127;		// 데이터 저장 변수 선언 + 초기화
	char* p = &value;		// 데이터 주소 저장 변수 선언

	// 변수 확인
	printf("변수 읽기 &value : %p, value : %d\n", &value, value);
	printf("변수 읽기 p      : %p, *p    : %d\n\n", p, *p);

	// 포인트변수 기반 값 변경
	*p = *p + 1;

	printf("변수 읽기 &value: %p,  value : %d\n", &value, value);
	printf("변수 읽기 p     : %p,  *p    : %d\n\n", p, *p);


	// 변수 기반 값 변경
	value = value + 1;

	printf("변수 읽기 &value: %p,  value : %d\n", &value, value);
	printf("변수 읽기 p     : %p,  *p    : %d\n\n", p, *p);

	return 0;
}