/* *************************************************************
* Filename     : ex04_pointer.c
* Description  : 포인터 변수의 연산
*				 역참조 연산자와 증감연산자 혼합
* Author       : LJG
* History	   : 2026-01-07
* ***************************************************************/

// --------------------------------------------------------------
// Library			
// --------------------------------------------------------------
#include <stdio.h>

// --------------------------------------------------------------
// Entry Point Function
// --------------------------------------------------------------
int main(void)
{
    // 변수 선언 및 초기화
    int value[] = { 10, 20, 30, 40,50 };   //데이터 저장 변수 선언 + 초기화
    int* p = value;                     // 배열명은 첫번째 원소 주소로 변환

    // 포인터 변수로 배열 원소 출력
    for (int idx = 0; idx < 5; idx++)
    {
        printf("value[%d] - %d\n", idx, *p++);   // 포인터에 요소 주소값이 업데이트
        printf("value[%d] - %d\n", idx, *(p + idx)); // p+0 = 4, p+1=4, p+2=4
    }

    // 배열이름으로 배열 원소 출력;
    for (int idx = 0; idx < 5; idx++)
    {
        // &value[0] + sizeof(int)*idx
        printf("[%d] - %d\n", idx, *(value + idx));
    }

    if (0) {
        // 정수형 배열 포인터 변수 p, 배열명, 배열0번 원소
        printf("p : 0x%p, value : 0x%p,  &value[0] : 0x%p\n\n", p, value, &value[0]);

        // 증감 연산자 & 포인터: 주소 증감
        for (int idx = 0; idx < 5; idx++)
            /*printf("value[%d]: %p, %d\n", idx, &value[idx], value[idx]);*/
            printf("value[%d]: %p, %d\n", idx, &value[idx], value[0 + idx]);

        // 포인터 변수로 배열 원소 접근 ----------------------------------------
        // *p: 연산자 우선순위 *(p++)
        //      => 후증가로 먼저 현재 주소로 처리 후 주소 1증가
        printf("p   : %p   *p : %d\n", p, *p);
        printf("p++   : %d   p : %p\n", *p++, p);

        // *++p: 연산자우선순위 *(++p)
        //       => 선증가로 주소 증가 후 그 곳의 값 역참조
        printf("p   : %p   *p : %d\n", p, *p);
        printf("*++p   : %d   p : %p\n", *++p, p);
    }

    return 0;
}