/* *************************************************************
* Filename     : ex05_pointer.c
* Description  : 포인터와 배열
*				 배열이름 => 표현식에서 사용되면 0번 원소 주소로 변환/decay(붕괴)
* Author       : LJG
* History	   : 2026-01-07
* ***************************************************************/

// --------------------------------------------------------------
// Library			
// --------------------------------------------------------------
#include <stdio.h>

// --------------------------------------------------------------
// Entry Point Function
// --------------------------------------------------------------
int main(void)
{
	// 변수 선언 및 초기화
	char* msg[] = "Good";
	char*	  p = msg;		// 배열이름 => &배열이름[0] 자동 변환

	// 배열이름 포인터처럼 사용해보기
	printf("*p : %c, msg : %c\n", *p, *msg);	// %s -> &배열이름[0] 자동 변환에서 종료문자까지
	printf("*p : %c, msg : %c\n", *p, *msg);    // %c -> &배열이름[0] 자동 변환. *&배열이름[0]

	// ★ 배열이름은 포인터 상수가 아님!!!
	printf("sizeof(msg) : %zu\n", sizeof(msg));
	printf("sizeof(p)   : %zu\n", sizeof(p));

	return 0;
}