/* *************************************************************
* Filename     : ex06_pointer.c
* Description  : 포인터와 배열
*				 함수의 매개변수 타입을 포인터로 사용 => 참조에 의한 호출 Call by Reference
*				 함수의 매개변수 타입을 일반 변수 사용 => 값에 의한 호출  Call by Value
* Author       : LJG
* History	   : 2026-01-07
* ***************************************************************/

// --------------------------------------------------------------
// Library			
// --------------------------------------------------------------
#include <stdio.h>


// --------------------------------------------------------------
// User Define Function
// --------------------------------------------------------------
void printValue(int   a, int  b);
void changeValue(int* a, int* b);


// --------------------------------------------------------------
// Entry Point Function
// --------------------------------------------------------------
int main(void)
{
	int a = 7, b = 8;

	// 함수 호출 => Call By Value
	printValue(a, b);
	printf("\n[main] a =%d, b = %d\n", a, b);

	// 함수 호출 => Call By Reference
	changeValue(&a, &b);
	printf("\n[main] a =%d, b = %d\n", a, b);

	return 0;
}



// --------------------------------------------------------------
// User Define Function
// --------------------------------------------------------------
void printValue(int   a, int  b)
{
	a += 10;
	b *= a;

	printf("a =%d, b = %d\n", a, b);
}

void changeValue(int* a, int* b)
{
	*a += 10;	// *a = *a + 10;
	*b *= *a;	// *b = *b * *a;
}