/* *************************************************************
* Filename     : ex07_pointer.c
* Description  : 포인터 상수
* Author       : LJG
* History	   : 2026-01-07
* ***************************************************************/

// --------------------------------------------------------------
// Library			
// --------------------------------------------------------------
#include <stdio.h>


// --------------------------------------------------------------
// Entry Point Function
// --------------------------------------------------------------
int main(void)
{
	const int MAX = 100;
	int		value = 10;

	int*       p1 = &value;
	const int* p2 = &MAX;

	// 현재값
	printf("*p1 = %d, value = %d\n", *p1, value);

	// 변경
	*p1 = 7;
	printf("*p1 = %d, value = %d\n", *p1, value);

	// 포인터에 저장되는 주소 변경
	p1 = &MAX;
	printf("*p1 = %d, MAX = %d\n", *p1, MAX);

	*p1 = 1000;
	printf("*p1 = %d, MAX = %d\n", *p1, MAX);

	// 상수 포인터로 값 변경 불가!!!
	//*p2 = 1000;
	printf("*p1 = %d, MAX = %d\n", *p2, MAX);


	// 상수 포인터에 저장하는 주소 변경
	p2 = &value;
	//*p2 = 333;
	printf("*p2 = %d, value = %d\n", *p2, value);

	return 0;
}



// --------------------------------------------------------------
// User Define Function
// --------------------------------------------------------------
void printValue(int   a, int  b)
{
	a += 10;
	b *= a;

	printf("a =%d, b = %d\n", a, b);
}

void changeValue(int* a, int* b)
{
	*a += 10;	// *a = *a + 10;
	*b *= *a;	// *b = *b * *a;
}