## ----------------------------------------------------------
## PANDAS WORK - WORK_1020_이준기
## ----------------------------------------------------------
import pandas as pd

## ----------------------------------------------------------
## 문제 1. 데이터를 시리즈 객체로 저장하기
## ----------------------------------------------------------
jumsu = ['점수', 100, 200, 300]
dataSR1 = pd.Series(jumsu)
print(dataSR1)

## ----------------------------------------------------------
## 문제 2. 데이터를 시리즈 객체로 저장하기
## ----------------------------------------------------------
idx = ['인덱스', '철수', '영희', '아름']
dataSR2 = pd.Series(jumsu, idx)
print(dataSR2)

## ----------------------------------------------------------
## 문제 3. 데이터를 시리즈 객체로 저장하기
##         저장 후 인덱스 속성과 형태 속성을 출력
## ----------------------------------------------------------
event = ['종목명', '삼성전자', '셀트리온', '카카오', '삼성전자우', '현대바이오']
e_price = ['종가', 73000, 356000, 367000, 68600, 34150]
dataSR3 = pd.Series(e_price, event)
print(f'인덱스 속성 : {dataSR3.index}')
print(f'형태   속성 : {dataSR3.shape}')

## ----------------------------------------------------------
## 문제 4. 파일을 읽어 DataFrame으로 저장하는 함수 적기
## ----------------------------------------------------------
DATA_FILE = ['data.xlsx',
             'data.csv',
             'data.json']
xlsxDF = pd.read_excel(DATA_FILE[0])
csvDF  = pd.read_csv(DATA_FILE[1])
jsonDF = pd.read_json(DATA_FILE[2])

## ----------------------------------------------------------
## 문제 5. 파일을 읽어 DataFrame으로 저장하기
## ----------------------------------------------------------
data   = [['김은수', 35, '과장'],
          ['박정민', 30, '대리'],
          ['이하나', 28, '대리']]
cols = [['이름', '나이', '직책']]

dataDF = pd.DataFrame(data, columns=cols)
print(dataDF.to_string(index=False))

## ----------------------------------------------------------
## 문제 6. 아래 데이터를 저장 후 조건을 만족하는 코드 작성하기
## ----------------------------------------------------------
data = [ ["2차전지(생산)", "SK이노베이션", 10.19, 1.29],
         ["해운", "팬오션", 21.23, 0.95], 
         ["시스템반도체", "티엘아이", 35.97, 1.12], 
         ["해운", "HMM", 21.52, 3.20], 
         ["시스템반도체", "아이에이", 37.32, 3.55], 
         ["2차전지(생산)", "LG화학", 83.06, 3.75]
]
columns = ["테마", "종목명", "PER", "PBR"]

## 6-1. DataFrame으로 저장하기
dataDF = pd.DataFrame(data, columns=columns)
## 6-2. 행인덱스를 SK, PO, TL, HMM, IA, LG로 설정해서 저장하기
rows = ['SK', 'PO', 'TL', 'HMM', 'IA', 'LG']
dataDF = pd.DataFrame(data, rows, columns)

## 6-3. 데이터 전체 출력하기
print(dataDF)

## 6-4. 행 인덱스 속성만 출력하기
print(f'행 인덱스 속성 : {dataDF.index}')

## 6-5. 형태 및 차원 정보 출력하기
print(f'형    태 : {dataDF.shape}')
print(f'차원 정보 : {dataDF.ndim}차원')


## 6-6. 컬럼 속성만 출력하기
print(f'컬럼 속성 : {dataDF.columns}')

## 6-7. 실제 메모리에 저장된 데이터만 출력
print(f'데이터 :\n{dataDF.values}')