/* *************************************************************
* Filename     : ex02_factorial.c
* Description  : 재귀함수
*                자기 자신을 호출하는 함수
*                스택오버플로우 발생할 수 있으므로 유효성 검사 코드
*                필수!!!
* Author       : LJG
* History	   : 2026-01-06
* ***************************************************************/
// --------------------------------------------------------------
// Library
// --------------------------------------------------------------
#include <stdio.h>


// --------------------------------------------------------------
// User Define Function
// --------------------------------------------------------------
// --------------------------------------------------------------
// 함수이름 : factorial
// 함수기능 : n! 계산 결과 반환
//            n! = n * (n-1) * (n-2) * ... * 1
// 매개변수 : int num
// 반 환 값 : 팩토리얼 결과. 반복적 곱셈 결과로 큰 타입 반환 필요
//            long long
// --------------------------------------------------------------
long long factorial(int n) {
    if (n <= 0 || n > 20) return -1;
    if (n <= 1)
        return 1;

    return n * factorial(n - 1);
}

// --------------------------------------------------------------
// Entry Point Function
// --------------------------------------------------------------
int main(void) {
    int i = 0;
    int n = 21;
    long long result = 0;

    for (i = 1; i <= n; i++) {
        result = factorial(i);
        if (result == -1) {
            printf("유효하지 않은 값입니다. (0<n<=20) : %d\n", n);
            break;
        }
        printf("%2d!=%20lld\n", i, result);
    }
    return 0;
}