/* *************************************************************
* Filename     : ex03_local_global.c
* Description  : 변수 종류
*				 전역변수와 지역변수
*                필수!!!
* Author       : LJG
* History	   : 2026-01-06
* ***************************************************************/
// --------------------------------------------------------------
// Library			<- preprocessor
// --------------------------------------------------------------
#include <stdio.h>


// --------------------------------------------------------------
// Global Variable & Constant
// --------------------------------------------------------------
int		  gMax  = 1000;
const int G_MIN = 10;


// --------------------------------------------------------------
// Entry Point Function : OS에서 호출되는 함수
// --------------------------------------------------------------
int main(void)
{
	// 지역변수
	int iValue;
	int gMax = 9;
	{
		int x = 10, y = 20;
		int iValue = 2000;

		printf("[블록] x= %d, y = %d, iValue = %d, gMax = %d\n", x, y, iValue, gMax);
	}

	// main함수 : 전역변수, 상수, 지역변수 접근
	// 지역변수 초기화 X
	printf("[메인] iValue = %d, gMax = %d, G_Min = %d\n", iValue, gMax, G_MIN);

	// main함수 : 다른 블록 안의 지역변수 접근 불가
	//printf("[메인] x = %d, y = %d\n", x, y);


	return 0;
}