- 오전 수업
# 9시 : app 만들기 HW 발표하기 (2명 지목)

# 9시 20분 : 돌아가면서 자기소개

# 9시 30분 : 수업 시작 (모듈 & 패키지 => (pdf 52page, 교재 573page))
- 설정에서 Chat : Disable AI Features 체크 (옆에 이상한 거 안 띄워줌)
- import math랑 random 배우기

# 10시 ~ 10시 23분 : 쉬는 시간 및 수업 시작
- from math import pi, factorial 같은 모듈 사용법 배움
- import random as r처럼 긴 모듈명을 약칭으로 사용하는 법
- pypi.org <= 이 사이트에서 패키지 설명 보고 사용 가능
- utils.py 만들어서 ex_custom에서 모듈 로딩해보기
- (conda install -c conda-forge pandas)  << 복사해서 vscode 터미널에 입력하여 설치 (만약 설치가 안 되면 cmd에서 가상환경으로 변경 후 입력하여 설치하기)

# 11:30 ~ 13:00 : 점심 시간

# 13:00 ~ 14:00 : 수업
- 노트북 시리얼 넘버 제출
- my_func.py 만들어서 모듈 로딩
- COMM폴더에 display.py 만들어서 모듈 로딩해보기

- ex_magic_variable.py 파일 만들어서 실습 <== ex_magic_import 만들어서 모듈 로딩 사용

===> 결론 어떤 함수가 공통적으로 자주 사용되면 모듈로 만들어서 로딩하면서 사용할지도 고민해봐야 한다!

# 14:15 ~ 15:00 : 수업
- Project 폴더 생성해서 프로젝트 시작 (교재 590page 패키지 만들기 설명 참고 ==> __init__.py 파일 만듦 (예전에는 이 파일이 무조건 있어야 해당 폴더를
                                                                                              패키지로 인식해줬는데 이젠 자동으로 해주긴 해서 없어도 되긴 함!))
- init 파일 설정에 따라 패키지 내 모듈들을 어떻게 불러들일 수 있는지에 대한 차이 실습 (교재 590page ~ 596page까지 실습. 596 하위 패키지 사용하기부터는 복잡해서 실습 X)

# 15:15 ~ 16:00 : 수업
- ex_random.py 만들어서 많이 사용하는 모듈에 대해서 실습
- ex_random_app.py를 통해 random 모듈 실습 진행(문제만 주시고 코드 짤 시간 주심)
- ex_os.py를 통해 os 모듈 실습 진행

# 16:30 ~ : 수업
- 구글 드라이브 Exam -> D1002에서 File_Explore.py 다운로드 받아 Windows의 탐색기 기능 직접 만드는 실습 진행 (원래 과젠데 연휴 때 쉬시라고 수업 시간에 진행)