## -----------------------------------------------------
##              내장 모듈 random 활용
## - random -> 난수 생성하거나 무작위 선택 할 때 사용
## -----------------------------------------------------
## [실습1] 로또 프로그램을 구현하세요.
##        - 숫자 범위 : 1 ~ 45
##        - 추출 숫자 : 6개 중복 X
##        - 조    건 : randint 사용
## -----------------------------------------------------
import random

number = []
i = 0
for _ in range(6):
    number.append(random.randint(1, 45))
    print(f'{i+1}번째 숫자는 {number[i]}번 입니다!')
    i += 1

print(f'당첨 로또 번호 6개는 {number}입니다!')
## 위 코드의 문제점 => 로또 번호가 중복이 발생함
