-- ========================================================================
-- Subquery : 쿼리 결과값을 활용한 쿼리문
-- ========================================================================
-- ------------------------------------------------------------------------
-- DB 선택
-- ------------------------------------------------------------------------
use sakila

-- ------------------------------------------------------------------------
-- [1] WHERE절 Subquery -> 중첩 서브쿼리. 대부분의 서브쿼리 해당
-- ------------------------------------------------------------------------
-- ROSA와 동일한 customer_id의 고객정보 추출
select * from customer
where customer_id = (
    select customer_id from customer
where first_name = 'ROSA'
);

set @u_id := ( select customer_id from customer
               where first_name = 'ROSA');

select * from customer
where customer_id = @u_id;

