-- ========================================================================
-- Subquery : 쿼리 결과값을 활용한 쿼리문
-- ========================================================================
-- ------------------------------------------------------------------------
-- DB 선택
-- ------------------------------------------------------------------------
use sakila

-- ------------------------------------------------------------------------
-- [1] WHERE절 Subquery -> 중첩 서브쿼리. 대부분의 서브쿼리 해당
--     연산자 IN, ANY, ALL, EXISTS 활용
-- ------------------------------------------------------------------------
-- [다중행 결과] ANA, ROSA와 동일한 customer_id의 고객정보 추출
-- 연산자 IN
select customer_id from customer
    where first_name in ('ROSA', 'ANA');

select * from customer
where customer_id in (
    select customer_id from customer
    where first_name in ('ROSA', 'ANA')
);

-- 연산자 ANY : 서브쿼리 결과 다중행 중 한 개라도 True면 True

