## ------------------------------------------------------------------
##                  내장 패키지 datetime 활용
##
## - datetime -> 날짜와 시간 처리를 위해 자주 사용
##            -> 날짜 생성, 현재 시각, 포맷 변환, 날짜 차이 계산
## ------------------------------------------------------------------
## 모듈 로딩
## ------------------------------------------------------------------
from datetime import datetime             ## 날짜와 시간 관련 모듈
from datetime import timedelta            ## 시간 계산 관련 모듈

## ------------------------------------------------------------------
## [1] 모듈 기본 활용
## ------------------------------------------------------------------
print('\n[1] 날짜 시간 기본 ++++++++++++++++')
##=> 현재 날짜와 시간
now = datetime.now()
print(f'현재 시각: {now}')

##=> 오늘 날짜
today = datetime.today()
print(f'오늘 날짜: {today.date()}')

##=> 특정 날짜/시간 생성 2025년 1월 1일 오전 9시 생성
dt = datetime(2025, 1, 1, 9, 0, 0)
print(f'지정된 날짜: {dt}')
print(f'지정된 년도: {dt.year}')
print(f'지정된 월  : {dt.month}')

## ------------------------------------------------------------------
## [2] 날짜 -> 문자열 반환 (strftime)
## ------------------------------------------------------------------
print('\n[2] 날짜 -> 문자열 변환 +++++++++++++++')
now = datetime.now()

##-> Y : 4자리 년도, y : 2자리 연도
##-> B : October ,  b : Oct
print(f"년-월-일: {now.strftime('%Y-%m-%d')}, {now.strftime('%y-%m-%d')}")
print(f"년-월-일: {now.strftime('%Y-%B-%d')}, {now.strftime('%y-%b-%d')}")

##-> H : 00 ~ 24,  I : 00 ~ 12
print(f"시:분:초: {now.strftime('%H:%M:%S')}, {now.strftime('%I:%M:%S')}")

##-> A : Monday ,  a : Mon
print(f"요    일: {now.strftime('%A')}")     # Monday, Tuesday ...
print(f"짧은 요일: {now.strftime('%a')}")     # Mon, Tue ...

## ------------------------------------------------------------------
## [3] 문자열 -> 날짜 변환 (strptime(문자열datetime, 문자열형식지정자))
## ------------------------------------------------------------------
date_str = "2025-10-02 14:30:00"
dt       = datetime.strptime(date_str, "%Y-%m-%d %H:%M:%S")

print("변환된 datetime 객체:", dt, dt.month)


## ------------------------------------------------------------------
## [3] 날짜 차이 계산 (timedelta)
## timedelta : 날짜/시간 차이 타입
## ------------------------------------------------------------------
print('\n[3] 날짜 차이 계산 ++++++++++++++++')
## 현재 날짜시간
today = datetime.today()

## => 7일 뒤
week_later = today + timedelta(days=7)
print(f"일주일 뒤 : {week_later}" )

## => 30일 전
month_ago = today - timedelta(days=30)
print(f'30일 전: {month_ago}' )

## => 두 날짜 차이
d1 = datetime(2025, 10, 1)
d2 = datetime(2025, 12, 25)
diff = d2 - d1
print(f"두 날짜 차이(일): {diff.days}")


## ------------------------------------------------------------------
## [4] 날짜와 시간 분리
## ------------------------------------------------------------------
print('\n[4] 날짜와 시간 분리 ++++++++++++++++')
## 현재 날짜 시간
now = datetime.now()
print(f'날짜 시간: {now}')
print(f'날짜 부분: {now.date()}')
print(f'시간 부분: {now.time()}')