## ==========================================================
## Python GUI Programming - TKinter
##
## ** Entry Widget : 사용자 텍스트기반 요청 전달받는 입력 UI 요소
## ==========================================================
## 모듈 로딩
## ==========================================================
from tkinter import *

## ----------------------------------------------------------
##- 윈도우 관련
## ----------------------------------------------------------
##- 윈도우 창 인스턴스 생성
mainWind=Tk()

##- 윈도우 창에 설정
## 창 제목
mainWind.title("MY APP")
# 창 크기와 위치 : "너비x높이+x좌표+y좌표"
mainWind.geometry("500x200+400+200")  ## "너비x높이+x좌표+y좌표"
## 창 크기 조절 : (WIDTH, HEIGHT)
mainWind.resizable(False, True)

## ----------------------------------------------------------
##- 윈도우에 배치될 UI 요소들 - Text Label 요소
## ----------------------------------------------------------
## 인스턴스 생성
inputFD = Entry(mainWind)

## UI 인스턴스 윈도우에 배치
inputFD.pack()

## ----------------------------------------------------------
##- 윈도우에서 발생하는 이벤트 메시지 수신
## ----------------------------------------------------------
##- 종료 전까지 동작
mainWind.mainloop()