## ==========================================================
## Python GUI Programming - TKinter
##
## ** Label Widget : 텍스트, 이미지 출력 UI요소
## ==========================================================
## 모듈 로딩
## ==========================================================
from tkinter import *

## ----------------------------------------------------------
##- 윈도우 관련
## ----------------------------------------------------------
##- 윈도우 창 인스턴스 생성
mainWind=Tk()

##- 윈도우 창에 설정
## 창 제목
mainWind.title("MY APP")
# 창 크기와 위치 : "너비x높이+x좌표+y좌표"
mainWind.geometry("500x200+400+200")  ## "너비x높이+x좌표+y좌표"
## 창 크기 조절 : (WIDTH, HEIGHT)
mainWind.resizable(False, True)

## ----------------------------------------------------------
##- 윈도우에 배치될 UI 요소들 - Text Label 요소
## ----------------------------------------------------------
## 인스턴스 생성
okBTN1 = Button(mainWind,
                text="msg Left",
                background='yellow',
                foreground='red',
                overrelief='sunken',
                padx=30)

## UI 인스턴스 윈도우에 배치
okBTN1.pack()

## ----------------------------------------------------------
##- 윈도우에서 발생하는 이벤트 메시지 수신
## ----------------------------------------------------------
##- 종료 전까지 동작
mainWind.mainloop()