/* *************************************************************
* Filename     : ex03_assign_op.c
* Description  : 대입/할당 연산자
*				 lvalue = rvalue;
*				 lvalue : 변수.	 상수(리터럴상수, 심볼상수) 불가!
*				 rvalue : 변수, 상수 모두 가능
*				 복합대입연산자 : 대입연산자와 다른 연산자 결합한 것
*				 lvalue 다른연산자 = rvalue
* Author       : LJG
* History	   : 2025.12.31
* ***************************************************************/
// --------------------------------------------------------------
// 라이브러리 로딩
// --------------------------------------------------------------
#include <stdio.h>


// --------------------------------------------------------------
// 엔트피포인트 함수
// --------------------------------------------------------------
int main(void)
{
	// 지역변수 선언 및 초기화
	int    num = 7;
	int result = 0;

	// 복합연산자 처리
	num = num + 10;
	num += 10;
	printf("num += 10 : %d\n", num);

	num *= 2;			// num = num * 2
	printf("num *= 2 : %d\n", num);

	num += 10 * num;	// num = num + (10*num)
	printf("num += 10 * num : %d\n", num);

	return 0;
}