/* *************************************************************
* Filename     : ex07_if_elseif_else.c
* Description  : 다중 조건문
*				 조건부 연산자 즉, 삼항연산자 비교
* Author       : LJG
* History	   : 2025.12.31
* ***************************************************************/
// --------------------------------------------------------------
// 라이브러리 로딩
// --------------------------------------------------------------
#include <stdio.h>

// --------------------------------------------------------------
// 엔트피포인트 함수
// --------------------------------------------------------------
int main(void)
{
	// 지역변수 선언 및 초기화
	int  no = 7;
	char ch = 'z';			// 1byte 정수 타입 문자 => ASCII 코드값
	char result = 0;

	// 입력받기
	printf("숫자 1개, 문자 1개 입력(예: 1 v):");
	if (scanf("%d %c", &no, &ch) != 2)
	{
		printf("정확한 입력이 아닙니다.");
		return 0;
	}

	// (1) 짝수 & 홀수 판별 출력
	if (no % 2)
		printf("%d - 홀수", no);
	else
		printf("%d - 짝수", no);

	// (2) 대문자 & 소문자 판별 출력
	/*if (ch >= 'A' && ch <= 'Z')
		printf("%c - 대문자", ch);
	else if (ch >= 'a' && ch <= 'z')
		printf("%c - 소문자", ch);
	else
		printf("%c - 알파벳아닙니다!", ch);*/

	//-> 조건부 연산자 즉, 삼항연산자로 구현
	(ch >= 'A' && ch <= 'Z') ? printf("%c - 대문자", ch) :
	((ch >= 'a' && ch <= 'z') ? printf("%c - 소문자", ch) : printf("%c - 알파벳아닙니다!", ch));

	return 0;
}