/* *************************************************************
* Filename     : ex08_nested_if.c
* Description  : 중첩 조건문
*				 조건부 안에 조건문
*				 입력 받은 숫자가 홀수/짝수 여부 출력
*				 숫자만 입력 가능함!
* Author       : LJG
* History	   : 2025.12.31
* ***************************************************************/
// --------------------------------------------------------------
// 라이브러리 로딩
// --------------------------------------------------------------
#include <stdio.h>

// --------------------------------------------------------------
// 엔트피포인트 함수
// --------------------------------------------------------------
int main(void)
{
	// 지역변수 선언 및 초기화
	char input = 0;
	int number = 0;

	// 입력 받기
	printf("숫자 1개 입력:");
	// (1) 숫자 1개 입력이 제대로 된 경우
	if (scanf("%c", &input) == 1)
	{
		// (2) '0' ~ '9' 검사
		if (input >= '0' && input <= '9')
		{
			// 형변환
			printf("%c => 형변환 %d\n", input, (int)input);
			//number = (int)input - 48;
			number = input - '0';
			printf("%c => 형변환 %d\n", input, number);

			(number % 2) ? printf("홀수") : printf("짝수");
		}
		else {
			printf("%c - 숫자 문자 아닙니다.", input);
		}
	}
	else 
		printf("정확한 입력이 아닙니다!");
	


	return 0;
}