/* *************************************************************
* Filename     : ex08_switch_case.c
* Description : switch ~ case 다중조건 처리문
*               if ~ else if ~ else 동일 가능
*               제약조건 => 정수, 상수만 가능함!
* Author       : LJG
* History	   : 2025.12.31
* ***************************************************************/
// --------------------------------------------------------------
// 라이브러리 로딩
// --------------------------------------------------------------
#include <stdio.h>

// --------------------------------------------------------------
// 엔트피포인트 함수
// [실습] 달을 입력 받아서 계절 출력하기
//		  12,  1,  2 => 겨울
//		   3,  4,  5 => 봄
//		   6,  7,  8 => 여름
//		   9, 10, 11 => 가을
// --------------------------------------------------------------
int main(void)
{
	// 지역변수 선언 및 초기화
	int		month = 0;
	char	season = 0;		// 1byte 정수 저장

	// 점수 입력 받기
	printf("달 입력 : ");
	if (scanf("%d", &month) != 1)
	{
		printf("입력이 올바르지 않습니다.");
		return 0;					// 종료
	}


	// 월에 따른 계절 출력 : switch_case
	switch (month)
	{
		case 3:
		case 4:
		case 5:
			printf("%d월은 봄입니다~", month);
			break;

		case 6:
		case 7:
		case 8:
			printf("%d월은 여름입니다~", month);
			break;

		case 9:
		case 10:
		case 11:
			printf("%d월은 가을입니다~", month);
			break;

		case 12:
		case 1:
		case 2:
			printf("%d월은 겨울입니다~", month);
			break;

	}

	return 0;
}