/* *************************************************************
* Filename     : ex12_for.c
* Description  : 반복문 - for
*				 반복 횟수가 명확한 반복문
* Author       : LJG
* History	   : 2025.12.31
* ***************************************************************/

// --------------------------------------------------------------
// Loading Library
// --------------------------------------------------------------
#include <stdio.h>


// --------------------------------------------------------------
// Entry Point Function
// --------------------------------------------------------------
int main(void)
{
	//(1) 1~10 숫자 출력
	const int TOTAL = 10;	//- 심볼 상수 : 값 변경 불가!!!

	//for(반복초기화; 반복제어조건식; 카운팅증감)
	for (int no = 1; no <= TOTAL; no++)
	{
		//->  1<=10 ---> 2
		//->  2<=10 ---> 3
		//-> 11<=10 ---> 거짓 : 반복 종료
		printf("%d - Happy New Year!!\n", no);
	}

	// for에서만 사용가능한 변수 => for 밖에서 사용 불가
	// C언어는 { }블록 단위
	//printf("%d - Happy New Year!!\n", no);

	return 0;
}