/* *************************************************************
* Filename     : ex13_for.c
* Description  : 반복문 - for
*				 반복 횟수가 명확한 반복문
* Author       : LJG
* History	   : 2025.12.31
* ***************************************************************/
// --------------------------------------------------------------
// Loading Library
// --------------------------------------------------------------
#include <stdio.h>

// 매크로 상수 -> 전처리기/컴파일러에서 처리
//				  파일 내에 LIMIT글자를 전부 30으로 치환
#define LIMIT 30

// --------------------------------------------------------------
// Entry Point Function - [실습] 다양한 증감제어
// --------------------------------------------------------------
int main(void)
{
	// (1) 2의 배수만 출력하기
	//     값 범위 : 1 ~ 30
	//     30 => 상수. 변경 불가

	// 지역벼수 선언
	int num = 0;

	// for 반복문
	for (num = 2; num <= LIMIT; num = num + 2)
	{
		printf("%d ", num);
	}
	
	// (2) 2의 배수 합계 계산하기
	int total = 0;
	for (num = 2; num <= LIMIT; num += 2)
	{
		total = total + num;
		printf("%d  %d\n", num, total);	
	}

	return 0;
}