## ====================================================================
##              Python GUI Programming - TKinter 
## ====================================================================
## LogIn 화면 구성
## - 사용 Widget
##   * Label   -  타이틀/아이디/비밀번호  3개
##   * Entry   -  아이디/비밀번호        2개
##   * Button  -  확인/취소             2개
## - 배치 Layout
##   * 표 형식의 Grid                 4행 4열
## - 행/열별 여백 설정
##   * padx    -  왼쪽, 오른쪽 바깥여백 설정
##   * pady    -  위쪽, 아래쪽 바깥여백 설정
## ====================================================================

## --------------------------------------------------------------------
## 모듈 로딩 
## --------------------------------------------------------------------
import tkinter

## --------------------------------------------------------------------
##- 윈도우 관련 
## --------------------------------------------------------------------
##- 윈도우 창 인스턴스 생성
window=tkinter.Tk()
window.title("LogIn")
window.geometry("200x200+500+200")
window.resizable(False,False)

## --------------------------------------------------------------------
##- 윈도우에 배치될 UI요소들 - Button 요소
## --------------------------------------------------------------------
## - 인스턴스 생성
## - 0번행 : 타이틀
titleLB = tkinter.Label(window, text="LOGIN")

## - 1번행 : ID 라벨과 입력필드
idLB = tkinter.Label(window, text="ID")
idENT = tkinter.Entry(window)

## - 2번행 : PW 라벨과 입력필드
pwLB = tkinter.Label(window, text="PW")
pwENT = tkinter.Entry(window)

## - 3번행 : Yes 버튼과 NO 버튼
yesBTN = tkinter.Button(window, text="YES")
noBTN = tkinter.Button(window, text="NO")

## --------------------------------------------------------------------
##- 화면에 BUtton 인스턴스 Grid 방식으로 배치
## --------------------------------------------------------------------
##- 0번행 배치 : 4개 컬럼 병합
##   pady=(위_여백값, 아래_여백값)
titleLB.grid(row=0, column=0, columnspan=4, pady=(10,5))

# - 1번행 배치 : Label 1개 컬럼, Entry 3개 컬럼 병합
##   pady=(위_여백값, 아래_여백값)
##   padx=(왼쪽_여백값, 오른쪽_여백값)
idLB.grid(row=1,  column=0, padx=(10,5))
idENT.grid(row=1, column=1, columnspan=3, pady=(10,5))

## - 2번행 배치 : Label 1개 컬럼, Entry 3개 컬럼 병합
##   pady=(위_여백값, 아래_여백값)
##   padx=(왼쪽_여백값, 오른쪽_여백값)
pwLB.grid(row=2,  column=0, padx=(10,5))
pwENT.grid(row=2, column=1, columnspan=3, pady=(5,10))

## - 3번행 배치 : Button별 2개 컬럼 병합
##   padx=(왼쪽_여백값, 오른쪽_여백값)
yesBTN.grid(row=3, column=0, columnspan=2, sticky='nesw', padx=(10,5))
noBTN.grid(row=3, column=2, columnspan=2 , sticky='nesw')

## --------------------------------------------------------------------
##- 윈도우에서 발생하는 사용자 이벤트 수신
## --------------------------------------------------------------------
##- 종료 전까지 동작
window.mainloop()