/* *************************************************************
* Filename     : ex01_ppointer.c
* Description  : 포인터 변수
* Author       : LJG
* History	   : 2026-01-08
* ***************************************************************/

// --------------------------------------------------------------
// Library			
// --------------------------------------------------------------
#include <stdio.h>

// --------------------------------------------------------------
// Entry Point Function
// --------------------------------------------------------------
int main(void)
{
	// 변수 선언 및 초기화
	int a;
	int* p;
	int** q;
	int*** r;

	p = &a;
	q = &p;
	r = &q;

	printf("숫자를 입력하세요: ");
	scanf("%d", &a);
	printf("입력한 숫자는: %d\n", a);

	printf("숫자를 입력하세요: ");
	scanf("%d", p);
	printf("입력한 숫자는: %d\n", a);

	printf("숫자를 입력하세요: ");
	scanf("%d", *q);
	printf("입력한 숫자는: %d\n", a);

	printf("숫자를 입력하세요: ");
	scanf("%d", **r);
	printf("입력한 숫자는: %d\n", a);
	

	return 0;
}