/* *************************************************************
* Filename     : ex03_ppointer.c
* Description  : 배열 포인터
*				 배열 주소 즉, 포인터를 여러개 저장하는 배열
* Author       : LJG
* History	   : 2026-01-08
* ***************************************************************/

// --------------------------------------------------------------
// Library			
// --------------------------------------------------------------
#include <stdio.h>

// --------------------------------------------------------------
// Entry Point Function
// --------------------------------------------------------------
int main(void)
{
	char* strings[3] = {
		"How are you?",
		"Hello World!",
		"C language Programming."
	};

	for (int i = 0; i < 3; i++) {
		printf("%s\n", strings[i]);
	}

	return 0;
}