/* *************************************************************
* Filename     : ex05_array_pointer.c
* Description  : 배열 포인터
*				 배열의 주소를 저장하는 포인터
*				 정수형 포인터 => 정수 데이터 주소
*				 문자형 포인터 => 문자 데이터 주소
*				 실수형 포인터 => 실수 데이터 주소
* Author       : LJG
* History	   : 2026-01-08
* ***************************************************************/

// --------------------------------------------------------------
// Library			
// --------------------------------------------------------------
#include <stdio.h>

// --------------------------------------------------------------
// Entry Point Function
// --------------------------------------------------------------
int main(void)
{
	// 배열 선언 및 초기화
	// 배열이름 => 배열 전체 대표하는 식별자
	//			   연산/표현식에 사용되면 0번째 원소 주소 자동 변환 (배열 붕괴 decay)
	// 배열이름을 포인터처럼 사용 가능.
	// 단!! 변경 X
	int nums[] = { 10,20,30 };
	int two[][3] = { {11,22,33}, {44,55,66} };

	// 포인터 변수 선언 및 초기화
	int* pOne     = nums;		// <- 0번째 원소 주소 자동 변환
	int(*pTwo)[3] = two;		// <- 0번행 주소 자동 변환


	//---> 배열 요소 접근 및 읽기
	for (int idx = 0; idx < 3; idx++)
	{
		//printf("[%d]번 요소 : %d, %p\n", idx, nums[idx], &nums[idx]);
		//printf("[%d]번 요소 : %d, %p\n", idx, *(nums + idx), &nums + idx);
		printf("[%d]번 요소 : %d, %p\n", idx, *(pOne + idx), pOne + idx);
	}

	//---> 2차원
	printf("2차원 배열 ----------------\n");
	for (int idx = 0; idx < 2; idx++)
	{
		// 0번행의 0번원소 &two[0][0] 주소로 자동 decay
		printf("[%d]번 요소 : %p, %p  %d\n", idx, two[idx], &two[idx], two[idx][0]);

		printf("[%d]번 요소 : %p, %p, %d\n", idx, pTwo + idx, *(pTwo + idx), **(pTwo + idx));
	}


	return 0;
}