## 전역변수 선언 ----------------------------------------
year = 2025
loc = '대구'

## 사용자 정의 함수 -------------------------------------
## 지역변수명과 전역변수명 동일할 경우
## => 함수에서는 지역변수 사용함!
def showInfo():
    year = 2030                  ## 동일변수명 경우 함수 안에 변수 사용
    print(f'올해 년도 : {year}')
    print(f'우리 지역 : {loc}')   ## (1)함수 안에서 찾기
                                 ## (2)함수 밖에서 찾기

## 전역변수 값을 함수내에서 변경하는 경우
## ==> global 전역변수명
def changeInfo():
    global year                  ## 명시적으로 전역변수 설정
    year = year + 1              ## 전역변수 year
    print(f'올해 년도 : {year}')
    print(f'우리 지역 : {loc}')   ## 전역변수 loc

## ----------------------------------------------------
## 기능 구현
## ----------------------------------------------------
showInfo()
changeInfo()
print(year)     # <= 전역변수 year 사용